####################################################################

 /$$                   /$$     /$$                                  
| $$                  | $$    | $$                                  
| $$$$$$$  /$$   /$$ /$$$$$$ /$$$$$$    /$$$$$$  /$$$$$$$   /$$$$$$$
| $$__  $$| $$  | $$|_  $$_/|_  $$_/   /$$__  $$| $$__  $$ /$$_____/
| $$  \ $$| $$  | $$  | $$    | $$    | $$  \ $$| $$  \ $$|  $$$$$$ 
| $$  | $$| $$  | $$  | $$ /$$| $$ /$$| $$  | $$| $$  | $$ \____  $$
| $$$$$$$/|  $$$$$$/  |  $$$$/|  $$$$/|  $$$$$:$/| $$  | $$ /$$$$$$$/
|_______/  \______/    \___/   \___/   \______/ |__/  |__/|_______/

####################################################################

button-subscribe = Ссылка на канал
button-check-subscribe = 📝 Проверить подписку 📝
button-confirm = ✅ Принять ✅ 
button-play = 🎮 Играть 🎮
button-balance = 💎 Баланс 💎
button-howtoplay = 📚 Как играть
button-referrals = Реферралы 👥
button-promocode = 🎟 Промокод
button-community = Комьюнити 👨‍👩‍👦‍👦
button-tonimport = Пополнить 🔼
button-getwallet = Кошелек 💰 
button-tonexport = Вывести 🔽
button-importcheck = ⭕️ Обновить ⭕️
button-howtogetton = Где взять TON?
button-public-game = 🔥 Присоединитсья
button-private-game = Создать 💥
button-demo-game = ⚙️  DEMO ⚙️
button-game-confirm = ✅ Подтвердить ✅ 
button-game-exit = ❌ Выйти из Игры ❌
button-game-end = ⭕️ Закончить игру ⭕️
button-play-again = 🔥 Играть снова 🔥
button-wait-check-o = Проверить...
button-wait-check-s = Проверить...
button-owner-ready = Готов!
button-wait-check-search = Проверить...
button-joined-check-s = Проверить...
button-joined-ready = Готов!
button-game-ready = 💥 Играть! 💥
button-back = ◀️  Назад ◀️
button-chest-first = 📦
button-chest-second = 📦
button-chest-third = 📦



#######################################################################
                                                                                   
                                                                                   
 /$$$$$$/$$$$   /$$$$$$   /$$$$$$$ /$$$$$$$  /$$$$$$   /$$$$$$   /$$$$$$   /$$$$$$$
| $$_  $$_  $$ /$$__  $$ /$$_____//$$_____/ |____  $$ /$$__  $$ /$$__  $$ /$$_____/
| $$ \ $$ \ $$| $$$$$$$$|  $$$$$$|  $$$$$$   /$$$$$$$| $$  \ $$| $$$$$$$$|  $$$$$$ 
| $$ | $$ | $$| $$_____/ \____  $$\____  $$ /$$__  $$| $$  | $$| $$_____/ \____  $$
| $$ | $$ | $$|  $$$$$$$ /$$$$$$$//$$$$$$$/|  $$$$$$$|  $$$$$$$|  $$$$$$$ /$$$$$$$/
|__/ |__/ |__/ \_______/|_______/|_______/  \_______/ \____  $$ \_______/|_______/ 
                                                      /$$  \ $$                    
                                                     |  $$$$$$/                    
                                                      \______/ 
#######################################################################


start-dialog = Хочешь искать сокровища? Подпишись на канал или останешься за бортом! 🏴‍☠️"

need-subscribe = Ты ещё не подписался на канал
                 Подпишись и попробуй снова!

welcome-dialog = Добро пожаловать, { $name }! 
                 Теперь ты настоящий пират☠

                 Йо-хо-хо! Тут все очень просто:
                 1. Вноси депозит в TON.
                 2. Отгадывай или прячь сундук с сокровищами.
                 3. Выводи приз на свой кошелек без ограничений (любой кошелек, поддерживающий TON).

                 Без обмана и хитростей:
                 1. Игроков: 2 (случайный игрок или твой знакомый юнга)
                 2. Сундуков: 3 (1 выигрышный)
                 3. Роли: Один прячет, другой ищет (тут как повезет, определяет бот)
                 4. Приз: Тот, кто лучше справился с ролью
                 5. Время на ход: 1 минута

                 ⚠️ Но помни:
                 1. Минимальный депозит: 0,5 TON
                 2. Коэффициент выигрыша: от 1,55X (зови друзей, и он вырастет)
                 3. ПРИЗ = Депозит X Коэффициент выигрыша (выводи в любое время, любую сумму — никаких ограничений.)

                 Приглашай друзей, зарабатывай с их побед и проигрышей, увеличивай коэффициент своего выигрыша.
                 Полных парусов и сухого плавания, капитан!🦜

main-menu = Ну вот ты и здесь! Мы уж думали, что акулы тобой позавтракали!

referrals = 👋 Приглашай друзей, зарабатывай с их побед и проигрышей, 
            увеличивай коэффициент своего выигрыша! 

            <b>Для приглашения используй реферальную ссылку: 

            <code>{ $link }</code>

            Кол-во рефералов: { $referrals }
            Твой Коэффициент: { $coef } 
            С игр друзей получаешь: { $comission }%</b>

            <b>🌐 1-15 приглашений:</b>
            10%% доход от прибыли с друзей
            Коэффициент 1,6X

            <b>🌐 15-90 приглашений:</b>
            20%% доход от прибыли с друзей
            Коэффициент 1,75X

            <b>🌐 90+ приглашений:</b>
            30%% доход от прибыли с друзей
            Коэффициент 1,9X

enter-promocode = Если у тебя есть секретный промокод введи его

                  И на следующей игре ты получишь
                  коэффициент Х2!

wrong-promocode = Такого промокода нет!

promocode-activated = Промокод активирован!!!

                      Следующая победа тебе принесет 
                      Х2 от депозита!

promocode-used-yet = Ты уже использовал этот промокод!

promocode-isactive = Ты не можешь использовать два промокода подряд!
                     Сперва используй бонус действующего промокода


#################
#  TRANSACTIONS #
#################

balance = ⏳ Все операции обычно занимают до 15 минут. Твои средства не будут потеряны

          На твоем балансе: { $ton_balance } TON💎

          🔼Пополнение: без ограничений
          🔽Вывод: без ограничений 

tonimport = Что бы пополнить кошелек нужно перевести TON на наш счет, 
            который указан ниже с добавлением ID (цифры ниже). 

            Что бы мы знали что, платёж
            сделан именно тобой - напиши в комментарии
            к переводу свой ID:
            { $id }

            ⚠️ Если отправишь без комментария - криптовалюта не попадет на твой кошелек!

            💳 Для получения адреса кошелька нажми кнопку «Кошелек»   

central-wallet = { $wallet }

tonexport = 🔽Минимальная сумма: без ограничений
         
            Что бы вывести TON - напиши в чат свой кошелек
            и через пробел сумму вывода

            Например:
            <code>UQDIkS1d_Lhd7EDttTtcmr9Xzg78uEMDEsYFde-PZCgfoOtU 2</code>

wrong-export = Проверь данные для вывода средств

               Неверный адрес кошелька
               или количество. 
               Напомним, что минимальный вывод - 1 TON

notenough-transaction = Перевод меньше 0.5 TON!
                        Такой перевод не может быть засчитан

no-transaction = Не было транзакции с комментарием
                 содержащим твой ID

tonimport-success = { $value } TON Успешно поступили
                    на твой игровой счёт!

old-transaction = Новой транзакции не было.
                  Последняя транзакция от тебя:
                  <code>{ $t_hash }</code>

                  На сумму { $t_value } TON

tonexport-success = Успешный вывод { $value } TON
                    На кошелек
                    <code>{ $address }</code>

tonexport-notenough = Недостаточно TON
                      На аккаунте { $user_ton } TON
                      Запрос на вывод { $value }

notenough-ton = Недостаточно TON!

tonexport-error = Что то пошло не по плану
                  Твоя транзакция не была отправлена
    
########################
# GAME MOD AND DEPOSIT #
########################

lobby-menu = Выбери, какую игру начать

             Присоединится - Найти игру со случайным пиратом.
             Создать - Создать свою комнату, чтобы играть с другом.
             
             Если друг тебе дал код-приглашение
             Просто введи его и отправь в чат!


select-deposit = Выбери депозит, на который хочешь играть:💰

notenough-ton = На твоем балансе недостаточно средств 
                для игры на такую сумму!☹️"

game-notexists = Такой игры нет!

game-confirm = Ты ищешь игру
               С депозитом { $deposit } TON


####################
# WAITING FOR GAME #
####################

ownerpublic = Ожидаем соперника для Игры!🎉

              Депозит: { $deposit } TON

ownerprivate = Ты создал приватную игру
               с депозитом { $deposit } TON
               Ты можешь пригласить в нее друга
               при помощи кода:
               <code>{ $invite_code }</code> 

search-game = Ищем для тебя игру!💥

              Депозит: { $deposit } TON

game-ready = Игра готова!⚡️
             C депозитом { $deposit } TON
             
             Нажмите кнопку: Начать, чтобы подтвердить свое участие, после депозит вернуть нельзя

still-waiting-opponent = Пока ждём соперника!

still-searching-game = Пока ищем подходящую игру!

waiting-foropponent = Ждём подтверждения соперника!

########
# GAME #
########

game-wait-searcher = Ваша игра началась!⚡️

                     Ты ищешь сокровища!

                     Депозит: <b>{ $deposit } TON</b>
                     Коэффициент: <b>{ $coef }</b>
                     Приз: <b>{ $prize } TON</b>

                     Ждем пока соперник спрячет сокровище, у него ровно минута!⏳

game-hidder = Ваша игра началась!⚡️

              Ты прячешь сокровища!

              Депозит: <b>{ $deposit } TON</b>
              Коэффициент: <b>{ $coef }</b>
              Приз: <b>{ $prize } TON</b>

              Снизу три сундука, выбери в какой из них ты спрячешь сокровища!💎
              Время ограничено, у тебя ровно минута, иначе ты сразу проиграешь!!!⏳

game-searcher = Ваша игра началась!⚡️

                Ты ищешь сокровища!

                Депозит: <b>{ $deposit } TON</b>
                Коэффициент: <b>{ $coef }</b>
                Приз: <b>{ $prize } TON</b>

                Ищи сокровище у тебя ровно минута!⏳

game-hidden = Ваша игра началась!⚡️

              Ты прячешь сокровища!

              Депозит: <b>{ $deposit } TON</b>
              Коэффициент: <b>{ $coef }</b>
              Приз: <b>{ $prize } TON</b>
              
              Ждём пока соперник найдёт сокровища💎
              

game-youwin = У Вас Дар!
              Вы забираете приз

game-youlose = Ты был близок к победе, 
               но твой соперник ближе

game-youlose-searcher = Ты был близок к победе, 
                        но твой соперник ближе

                        Сокровища были в сундуке №<b>{ $chest }</b>

###################
# Unknown Message #
###################

unknown-message = Не понял, что ты сказал....
